In [1]:
import pandas as pd

In [20]:
#on is unique for the identifier
#it should be present in both tables(column)
#how => inner, left, right
# inner => match both tables
# left => all records from first table
# right => all records from right table
#outer=? all records from both tables

In [6]:
registration=pd.DataFrame({"reg_id":[1,2,3,4],"name":["Neeraj","Deepak","Yogesh","Suraj"]})
login=pd.DataFrame({"log_id":[1,2,3,4],"name":["Rahul","Neeraj","Suraj","Sumit"]})

In [7]:
registration

   reg_id    name
0       1  Neeraj
1       2  Deepak
2       3  Yogesh
3       4   Suraj

In [8]:
login

   log_id    name
0       1   Rahul
1       2  Neeraj
2       3   Suraj
3       4   Sumit

In [11]:
# help(pd.merge)

# Inner

In [14]:
pd.merge(registration,login,how="inner",on="name")

   reg_id    name  log_id
0       1  Neeraj       2
1       4   Suraj       3

# Left

In [17]:
pd.merge(left=registration,right=login,how="left",on="name")

   reg_id    name  log_id
0       1  Neeraj     2.0
1       2  Deepak     NaN
2       3  Yogesh     NaN
3       4   Suraj     3.0

# Right

In [18]:
pd.merge(left=registration,right=login,how="right",on="name")

   reg_id    name  log_id
0     NaN   Rahul       1
1     1.0  Neeraj       2
2     4.0   Suraj       3
3     NaN   Sumit       4

pandas will understand automically about "ON" option if there is only one main option, but for better practice always 
mention this

In [19]:
pd.merge(left=registration,right=login,how="right")

   reg_id    name  log_id
0     NaN   Rahul       1
1     1.0  Neeraj       2
2     4.0   Suraj       3
3     NaN   Sumit       4

# Outer

In [21]:
pd.merge(left=registration,right=login,how="outer",on="name")

   reg_id    name  log_id
0     1.0  Neeraj     2.0
1     2.0  Deepak     NaN
2     3.0  Yogesh     NaN
3     4.0   Suraj     3.0
4     NaN   Rahul     1.0
5     NaN   Sumit     4.0

In [22]:
# Now suppose we have "ON" as index of first table

In [23]:
registration1=pd.DataFrame({"reg_id":[1,2,3,4],"name":["Neeraj","Deepak","Yogesh","Suraj"]})
login1=pd.DataFrame({"log_id":[1,2,3,4],"name":["Rahul","Neeraj","Suraj","Sumit"]})

In [26]:
registration1.set_index("name",inplace=True)

In [27]:
registration1

        reg_id
name
Neeraj       1
Deepak       2
Yogesh       3
Suraj        4

In [29]:
pd.merge(registration1,login1,how="inner",left_index=True,right_on="name")

   reg_id  log_id    name
1       1       2  Neeraj
2       4       3   Suraj

In [35]:
registration1=registration1.reset_index()
registration1

     name  reg_id
0  Neeraj       1
1  Deepak       2
2  Yogesh       3
3   Suraj       4

In [39]:
registration1.columns=["reg_name","reg_id"]
registration1

  reg_name  reg_id
0   Neeraj       1
1   Deepak       2
2   Yogesh       3
3    Suraj       4

In [40]:
pd.merge(registration1,login1,how="inner",left_on="reg_name",right_on="name")

  reg_name  reg_id  log_id    name
0   Neeraj       1       2  Neeraj
1    Suraj       4       3   Suraj

In [41]:
registration1.columns=["name","id"]
registration1

     name  id
0  Neeraj   1
1  Deepak   2
2  Yogesh   3
3   Suraj   4

In [48]:
login1.columns=["id","name"]
login1

   id    name
0   1   Rahul
1   2  Neeraj
2   3   Suraj
3   4   Sumit

In [50]:
#pandas automatically add suffix in same name columns 
pd.merge(registration1,login1,how="inner",on="name")

     name  id_x  id_y
0  Neeraj     1     2
1   Suraj     4     3

In [52]:
pd.merge(registration1,login1,how="inner",on="name",suffixes=("_reg","_log"))

     name  id_reg  id_log
0  Neeraj       1       2
1   Suraj       4       3